Tekla Open API Reference for Tekla Structures 2025
Face.OriginPartId Property
 The part id of the part that this face originated from. For example, a face create by a part cut has the id of the cutting part.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier OriginPartId { get; }
Public ReadOnly Property OriginPartId As Identifier
	Get
Property Value
Type: Identifier
See Also
Reference
Face Class
Tekla.Structures.Solid Namespace